app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Mike"], ["phone", "1234567890"], ["created_at", "2021-07-15 02:22:42.586591"], ["updated_at", "2021-07-15 02:22:42.586591"]]